---
kind: method
id: M:Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorTowardsColor(Autodesk.Revit.DB.Color)
source: html/e1fe7475-da92-1a84-9149-b0f5fd12ed4d.htm
---
# Autodesk.Revit.UI.UIFabricationUtils.SetOpenConnectorIndicatorTowardsColor Method

Sets the color of the open connector indicator in towards direction

## Syntax (C#)
```csharp
public static void SetOpenConnectorIndicatorTowardsColor(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null